Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsInSameRegionLoadAreas
Multiple [Room] are in the same enclosed region.  The correct area and perimeter will be assigned to one [Room] and the others will display     "Redundant [Room]."  You should separate the regions, delete the extra [Room], or move them into different regions.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedLoadAreas
[Room] is not in a properly enclosed region

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.LoadareaRecovered
The boundary encloses the region for area based load:[Areabasedload].